app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      #binding.pry
      if Artist.pluck(:id).index(params[:artist_id]).nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @songs = Artist.find(params[:artist_id])
      end
    else
      @songs = Song.all
---
SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    binding.pry
    if Song.find_by(id: params[:id])
      @song = Song.find(params[:id])
    else
      binding.pry
      #flash[:alert] = "Cannot find song"
      @artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]